# DuctInsulation Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctInsulation Class
Members See Also
---
Represents insulation applied to the outside of a given duct , fitting or accessory.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class DuctInsulation : InsulationLiningBase
```

Visual Basic
---
```text
Public Class DuctInsulation _
	Inherits InsulationLiningBase
```

Visual C++
---
```text
public ref class DuctInsulation : public InsulationLiningBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB..::..InsulationLiningBase Autodesk.Revit.DB.Mechanical..::..DuctInsulation
# See Also
DuctInsulation Members
Autodesk.Revit.DB.Mechanical Namespace